In [4]:
# BASIC OOP REFRESHER

# create a dog object

class Dog:
    
    # initialize the constructor
    def __init__(self, color, breed, gender, yob, name):
        self.color = color
        self.breed = breed
        self.gender = gender
        self.yob = yob
        self.danger = False
        self.attack = False
        self.name = name
        
    
    # create the methods of the object
    
    def bark(self, intensity = 'l'):
        if intensity == 'l':
            print('WOOOF!')
        elif intensity == 'h':
            print('wooooooooooooooooooooof!!!!!!!!')
    
    def run(self, danger = False):
        if danger:
            self.danger = True
            self.attack = True
            print('running really fast')
        elif danger == False:
            print('RUNNING AND HAVING FUN')
    
    def calm(self):
        if self.attack:
            self.attack = False
            self.danger = False
            print('calming the dog')
        elif self.attack == False:
            print(f'{self.name} is calm already..')

In [5]:
bruno = Dog(color = 'red', breed = 'Rott', gender = 'female', yob = 2015 , name = 'Bruno')

In [10]:
bruno.yob

2015

In [12]:
bruno.bark('h')

wooooooooooooooooooooof!!!!!!!!

In [14]:
bruno.run(True)

running really fast

In [16]:
bruno.calm()

Bruno is calm already..

In [17]:
print(type(bruno))

<class '__main__.Dog'>

### EXPLORATORY DATA ANALYSIS WITH PANDAS AND NUMPY

In [18]:
# import the libraries

import pandas as pd
import numpy as np

In [19]:
# creating a list and a numpy array
age = [12,13,14,25]
age_2 = np.array([12,13,14,25])

In [20]:
print(type(age))
print(type(age_2))

<class 'list'>
<class 'numpy.ndarray'>

In [27]:
a = np.array([[1,2,3],
              [4,5,6],
              [7,8,9]])


print(type(a))

<class 'numpy.ndarray'>

In [22]:
a.shape

(3, 3)

In [26]:
# checking the datatype of element
a.dtype

dtype('<U11')

In [ ]:
# creating pandas dataframe

# 1. from dictionaries or list of lists
# 2. load from local file 
# 3. connect to a database or an API

In [30]:
# method 1 

# create a students table

students = {
    
    'name':['zainab', 'yemi', 'ayo', 'ade', 'wale'],
    'age': [2,3,4,5,6],
    'height' : [11.2,12,32.5,34,12],
    'color':  ['red','red','black','blue','yellow']   
}

students_df = pd.DataFrame(students)

In [31]:
students_df

     name  age  height   color
0  zainab    2    11.2     red
1    yemi    3    12.0     red
2     ayo    4    32.5   black
3     ade    5    34.0    blue
4    wale    6    12.0  yellow

In [33]:
students_list = [
    ['wale', 32, 55.3, 'blue'],
    ['wasiu', 22, 55.3, 'red'],
    ['wale', 32, 55, 'blue'],
    ['sade', 12, 53, 'blue'],
    ['wale', 32, 5.3, 'blue'],
    ['wale', 62, 55.3, 'blue']  
]

columns = ['name', 'age', 'height', 'color']
students_df2 = pd.DataFrame(data= students_list, columns= columns)

In [34]:
students_df2

    name  age  height color
0   wale   32    55.3  blue
1  wasiu   22    55.3   red
2   wale   32    55.0  blue
3   sade   12    53.0  blue
4   wale   32     5.3  blue
5   wale   62    55.3  blue

In [35]:
# METHOD 2 

netflix_df = pd.read_csv('most-popular.csv')

In [37]:
netflix_df.head()

,category,rank,show_title,season_title,hours_viewed_first_91_days,runtime,views_first_91_days
0,Films (English),1,Red Notice,NaN,454200000,1.9667,230900000
1,Films (English),2,Don't Look Up,NaN,408600000,2.3833,171400000
2,Films (English),3,The Adam Project,NaN,281000000,1.7833,157600000
3,Films (English),4,Bird Box,NaN,325300000,2.0667,157400000
4,Films (English),5,The Gray Man,NaN,299500000,2.1500,139300000

In [38]:
food_df = pd.read_csv(r'C:\Users\hp\Desktop\New folder\world_food.csv')

In [39]:
food_df.head(5)

,Entity,Year,Maize Production (tonnes),Rice Production ( tonnes),Yams Production (tonnes),Wheat Production (tonnes),Tomatoes Production (tonnes),Tea Production ( tonnes ),Sweet potatoes Production (tonnes),Sunflower seed Production (tonnes),...,Oranges Production (tonnes),"Peas, dry Production ( tonnes)",Palm oil Production (tonnes),Grapes Production (tonnes),"Coffee, green Production ( tonnes)",Cocoa beans Production (tonnes),"Meat, chicken Production (tonnes)",Bananas Production ( tonnes),Avocados Production (tonnes),Apples Production (tonnes)
0,Afghanistan,1961,700000.0,319000.0,7467702.0,2279000.0,1873812.0,56315.0,3270871.0,12000.0,...,10100.0,232910.0,1131882.0,225000.0,870970.0,835368.0,5600.0,3139079.0,63439.0,15100.0
1,Afghanistan,1962,700000.0,319000.0,7420515.0,2279000.0,2044797.0,61519.0,3562524.0,12800.0,...,10100.0,259412.0,1111006.0,225000.0,883512.0,867170.0,6000.0,3181580.0,65118.0,15100.0
2,Afghanistan,1963,713000.0,319000.0,8479074.0,1947000.0,2096077.0,63596.0,3409916.0,12800.0,...,10100.0,251529.0,1145004.0,225000.0,996674.0,922621.0,6160.0,3304256.0,61760.0,15100.0
3,Afghanistan,1964,720000.0,380000.0,9113779.0,2230000.0,2388264.0,66604.0,3229336.0,12800.0,...,12400.0,247556.0,1160831.0,265000.0,1162048.0,1190061.0,6400.0,3392527.0,62759.0,18400.0
4,Afghanistan,1965,720000.0,380000.0,10067913.0,2282000.0,2559608.0,72418.0,3169104.0,13200.0,...,13700.0,266947.0,1138860.0,287000.0,1075084.0,874245.0,6800.0,3450849.0,66269.0,20400.0

## Assignment

1. create a 15 by 2 numpy array from a python list of lists
2. create an orders dataframe with 10 columns and atleast 10 records using either list of lists or dictionaries
3. download any kaggle dataset and load them using read_csv